"use strict";

// Задача №1
let someVar = 0;
++someVar;

if (someVar) {
   console.log(someVar);
}
// До консолі потрапить 1, тому що змінна someVar приймає значення 0(let someVar = 0;)
// Потім наша змінна збільшується на 1(++someVar;)
// Наступним кроком перевіряєть умова з нашою змінною чи є вона true (if (someVar))
// Якщо виконується умова то в консоль потрапить наша змінна(console.log(someVar);)

// Задача №2
for (let i = 1; i <= 10; ++i) {
   console.log(`Пункт №${i}`);
}
// Для того щоб вивести в консоль 10 рядків(Пункт №$1...) за допомогою цикла for потрібно
// Створити цикл for і створити в ньому змінну "і" і присвоїти їй значення 1 (let i = 1)
// Наш цикл на кожній ітерації буде збільшуватися на 1(++і)
// І буде відбуватися поки "і" не буде рівне 10
// На кожній ітерації ми будемо виводити наш пункт в консоль (console.log(`Пункт №${i}`);)

// Задача №3
if (2 * 20 <= 10 || (30 / 2 < 5 && 10 <= "10") || 20 === "20") {
   console.log("000");
}

// До консолі нічого не потрапить, тому що не виконалася умова
// Спочатку виконаємо дії з даними операторами (*, <=, /,  ===)
// Переводимо значення умови в тип булеан
// if (false || (false && true) || false)
// Далі ми проводимо операції з оператором &&
// І ми отримуємо дану умову if (false || false || false)
// Результатом умови вище буде false тобто в консоль нічого не потрапить

// Задача №4
// Створюємо функцію getResult() яка приймає два значення (a = 1, b = 1)
function getResult(a = 1, b = 1) {
   // В функції створюємо змінну result і присвоюємо їй значення, ділення а на b
   let result = a / b;

   // Наступним кроком створюємо умову в якій прописуємо за яких умов ми отримаємо помилку
   // Перша умова перевіряє чи друге значеннч не дорівнює 0 (b === 0 )
   // Друга умова перевіряє чи нашa змінна є числом (isNaN(result)
   // Третя умова перевіряє чи нашa змінна є не нескінченою
   // Всі ці умови розділяємо оператором ||(або)
   if (b === 0 || isNaN(result) || !isFinite(result)) {
      // Якщо хоч одна з умов виконалася то повертаємо в консоль "ERROR"
      return console.log("ERROR");
   }

   // У всіх інших випадках повернеться Результат ділення: a / b
   return console.log(`Результат ділення: ${result}`);
}

getResult(5, 50);
getResult(20, 5);
getResult(20, "");
getResult(20, "0");
getResult(20, "rt");
getResult("yy", 5);
getResult(0, 5);
getResult(20, "0");

// Задача №5
// Створюємо масив з 6 елементами a також створюємо змінну з заданим числом для пошуку
const OUR_NUMBER = 10;
let array = [3, "Hello", "Name", 10, "10", -10];

// Далі перебераємо наш масив за допомогою циклу forEach
array.forEach((value) => {
   //Задаєм умову за якої один із елементів масиву буде дорівнювати нашому числу
   if (value === OUR_NUMBER) {
      // Якщо умова виконається то в консоль виведеться наше число
      console.log(OUR_NUMBER);
   }
});
